FemDesign.Cover
cover_type

FemDesign.Cover._coverInstance
Cover instance number

FemDesign.Cover._name
Identifier

FemDesign.Cover.LoadBearingDirection
Load bearing direction (point_type_3d)

FemDesign.Cover.Region
Region (region_type).

FemDesign.Cover.SupportingStructures
Supporting structures (cover_referencelist_type)

FemDesign.Cover.#ctor
Parameterless constructor for serialization.

FemDesign.Cover.#ctor(FemDesign.Geometry.Region,FemDesign.CoverReferenceList,FemDesign.Geometry.Vector3d,System.String)
Construct a cover
region: Region of cover.
supportingStructures: Guidlist of supporting structure.
loadBearingDirection: Vector, if null a TwoWay cover is defined.

FemDesign.Cover.OneWayCover(FemDesign.Geometry.Region,System.Collections.Generic.List{System.Object},FemDesign.Geometry.Vector3d,System.String)
Create OneWayCover.

FemDesign.Cover.TwoWayCover(FemDesign.Geometry.Region,System.Collections.Generic.List{System.Object},System.String)
Create TwoWayCover.